MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamrh71/thirdparty/atsamrh71/component/pio.h
#define   PIO_MSKR_MSK17_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK17_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK17_DISABLED               (PIO_MSKR_MSK17_DISABLED_Val << PIO_MSKR_MSK17_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK17_ENABLED                (PIO_MSKR_MSK17_ENABLED_Val << PIO_MSKR_MSK17_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK18_Pos                    _U_(18)                                              /**< (PIO_MSKR) PIO Line 18 Mask Position */
#define PIO_MSKR_MSK18_Msk                    (_U_(0x1) << PIO_MSKR_MSK18_Pos)                     /**< (PIO_MSKR) PIO Line 18 Mask Mask */
#define PIO_MSKR_MSK18(value)                 (PIO_MSKR_MSK18_Msk & ((value) << PIO_MSKR_MSK18_Pos))
#define   PIO_MSKR_MSK18_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK18_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK18_DISABLED               (PIO_MSKR_MSK18_DISABLED_Val << PIO_MSKR_MSK18_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK18_ENABLED                (PIO_MSKR_MSK18_ENABLED_Val << PIO_MSKR_MSK18_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK19_Pos                    _U_(19)                                              /**< (PIO_MSKR) PIO Line 19 Mask Position */
#define PIO_MSKR_MSK19_Msk                    (_U_(0x1) << PIO_MSKR_MSK19_Pos)                     /**< (PIO_MSKR) PIO Line 19 Mask Mask */
#define PIO_MSKR_MSK19(value)                 (PIO_MSKR_MSK19_Msk & ((value) << PIO_MSKR_MSK19_Pos))
#define   PIO_MSKR_MSK19_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK19_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK19_DISABLED               (PIO_MSKR_MSK19_DISABLED_Val << PIO_MSKR_MSK19_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK19_ENABLED                (PIO_MSKR_MSK19_ENABLED_Val << PIO_MSKR_MSK19_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK20_Pos                    _U_(20)                                              /**< (PIO_MSKR) PIO Line 20 Mask Position */
#define PIO_MSKR_MSK20_Msk                    (_U_(0x1) << PIO_MSKR_MSK20_Pos)                     /**< (PIO_MSKR) PIO Line 20 Mask Mask */
#define PIO_MSKR_MSK20(value)                 (PIO_MSKR_MSK20_Msk & ((value) << PIO_MSKR_MSK20_Pos))
#define   PIO_MSKR_MSK20_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK20_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK20_DISABLED               (PIO_MSKR_MSK20_DISABLED_Val << PIO_MSKR_MSK20_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK20_ENABLED                (PIO_MSKR_MSK20_ENABLED_Val << PIO_MSKR_MSK20_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK21_Pos                    _U_(21)                                              /**< (PIO_MSKR) PIO Line 21 Mask Position */
#define PIO_MSKR_MSK21_Msk                    (_U_(0x1) << PIO_MSKR_MSK21_Pos)                     /**< (PIO_MSKR) PIO Line 21 Mask Mask */
#define PIO_MSKR_MSK21(value)                 (PIO_MSKR_MSK21_Msk & ((value) << PIO_MSKR_MSK21_Pos))
#define   PIO_MSKR_MSK21_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK21_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK21_DISABLED               (PIO_MSKR_MSK21_DISABLED_Val << PIO_MSKR_MSK21_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK21_ENABLED                (PIO_MSKR_MSK21_ENABLED_Val << PIO_MSKR_MSK21_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK22_Pos                    _U_(22)                                              /**< (PIO_MSKR) PIO Line 22 Mask Position */
#define PIO_MSKR_MSK22_Msk                    (_U_(0x1) << PIO_MSKR_MSK22_Pos)                     /**< (PIO_MSKR) PIO Line 22 Mask Mask */
#define PIO_MSKR_MSK22(value)                 (PIO_MSKR_MSK22_Msk & ((value) << PIO_MSKR_MSK22_Pos))
#define   PIO_MSKR_MSK22_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK22_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK22_DISABLED               (PIO_MSKR_MSK22_DISABLED_Val << PIO_MSKR_MSK22_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK22_ENABLED                (PIO_MSKR_MSK22_ENABLED_Val << PIO_MSKR_MSK22_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK23_Pos                    _U_(23)                                              /**< (PIO_MSKR) PIO Line 23 Mask Position */
#define PIO_MSKR_MSK23_Msk                    (_U_(0x1) << PIO_MSKR_MSK23_Pos)                     /**< (PIO_MSKR) PIO Line 23 Mask Mask */
#define PIO_MSKR_MSK23(value)                 (PIO_MSKR_MSK23_Msk & ((value) << PIO_MSKR_MSK23_Pos))
#define   PIO_MSKR_MSK23_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK23_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK23_DISABLED               (PIO_MSKR_MSK23_DISABLED_Val << PIO_MSKR_MSK23_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK23_ENABLED                (PIO_MSKR_MSK23_ENABLED_Val << PIO_MSKR_MSK23_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK24_Pos                    _U_(24)                                              /**< (PIO_MSKR) PIO Line 24 Mask Position */
#define PIO_MSKR_MSK24_Msk                    (_U_(0x1) << PIO_MSKR_MSK24_Pos)                     /**< (PIO_MSKR) PIO Line 24 Mask Mask */
#define PIO_MSKR_MSK24(value)                 (PIO_MSKR_MSK24_Msk & ((value) << PIO_MSKR_MSK24_Pos))
#define   PIO_MSKR_MSK24_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK24_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK24_DISABLED               (PIO_MSKR_MSK24_DISABLED_Val << PIO_MSKR_MSK24_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK24_ENABLED                (PIO_MSKR_MSK24_ENABLED_Val << PIO_MSKR_MSK24_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK25_Pos                    _U_(25)                                              /**< (PIO_MSKR) PIO Line 25 Mask Position */
#define PIO_MSKR_MSK25_Msk                    (_U_(0x1) << PIO_MSKR_MSK25_Pos)                     /**< (PIO_MSKR) PIO Line 25 Mask Mask */
#define PIO_MSKR_MSK25(value)                 (PIO_MSKR_MSK25_Msk & ((value) << PIO_MSKR_MSK25_Pos))
#define   PIO_MSKR_MSK25_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK25_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK25_DISABLED               (PIO_MSKR_MSK25_DISABLED_Val << PIO_MSKR_MSK25_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK25_ENABLED                (PIO_MSKR_MSK25_ENABLED_Val << PIO_MSKR_MSK25_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK26_Pos                    _U_(26)                                              /**< (PIO_MSKR) PIO Line 26 Mask Position */
#define PIO_MSKR_MSK26_Msk                    (_U_(0x1) << PIO_MSKR_MSK26_Pos)                     /**< (PIO_MSKR) PIO Line 26 Mask Mask */
#define PIO_MSKR_MSK26(value)                 (PIO_MSKR_MSK26_Msk & ((value) << PIO_MSKR_MSK26_Pos))
#define   PIO_MSKR_MSK26_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK26_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK26_DISABLED               (PIO_MSKR_MSK26_DISABLED_Val << PIO_MSKR_MSK26_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK26_ENABLED                (PIO_MSKR_MSK26_ENABLED_Val << PIO_MSKR_MSK26_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK27_Pos                    _U_(27)                                              /**< (PIO_MSKR) PIO Line 27 Mask Position */
#define PIO_MSKR_MSK27_Msk                    (_U_(0x1) << PIO_MSKR_MSK27_Pos)                     /**< (PIO_MSKR) PIO Line 27 Mask Mask */
#define PIO_MSKR_MSK27(value)                 (PIO_MSKR_MSK27_Msk & ((value) << PIO_MSKR_MSK27_Pos))
#define   PIO_MSKR_MSK27_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK27_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK27_DISABLED               (PIO_MSKR_MSK27_DISABLED_Val << PIO_MSKR_MSK27_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK27_ENABLED                (PIO_MSKR_MSK27_ENABLED_Val << PIO_MSKR_MSK27_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK28_Pos                    _U_(28)                                              /**< (PIO_MSKR) PIO Line 28 Mask Position */
#define PIO_MSKR_MSK28_Msk                    (_U_(0x1) << PIO_MSKR_MSK28_Pos)                     /**< (PIO_MSKR) PIO Line 28 Mask Mask */
#define PIO_MSKR_MSK28(value)                 (PIO_MSKR_MSK28_Msk & ((value) << PIO_MSKR_MSK28_Pos))
#define   PIO_MSKR_MSK28_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK28_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK28_DISABLED               (PIO_MSKR_MSK28_DISABLED_Val << PIO_MSKR_MSK28_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK28_ENABLED                (PIO_MSKR_MSK28_ENABLED_Val << PIO_MSKR_MSK28_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK29_Pos                    _U_(29)                                              /**< (PIO_MSKR) PIO Line 29 Mask Position */
#define PIO_MSKR_MSK29_Msk                    (_U_(0x1) << PIO_MSKR_MSK29_Pos)                     /**< (PIO_MSKR) PIO Line 29 Mask Mask */
#define PIO_MSKR_MSK29(value)                 (PIO_MSKR_MSK29_Msk & ((value) << PIO_MSKR_MSK29_Pos))
#define   PIO_MSKR_MSK29_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK29_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK29_DISABLED               (PIO_MSKR_MSK29_DISABLED_Val << PIO_MSKR_MSK29_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK29_ENABLED                (PIO_MSKR_MSK29_ENABLED_Val << PIO_MSKR_MSK29_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK30_Pos                    _U_(30)                                              /**< (PIO_MSKR) PIO Line 30 Mask Position */
#define PIO_MSKR_MSK30_Msk                    (_U_(0x1) << PIO_MSKR_MSK30_Pos)                     /**< (PIO_MSKR) PIO Line 30 Mask Mask */
#define PIO_MSKR_MSK30(value)                 (PIO_MSKR_MSK30_Msk & ((value) << PIO_MSKR_MSK30_Pos))
#define   PIO_MSKR_MSK30_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK30_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK30_DISABLED               (PIO_MSKR_MSK30_DISABLED_Val << PIO_MSKR_MSK30_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK30_ENABLED                (PIO_MSKR_MSK30_ENABLED_Val << PIO_MSKR_MSK30_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK31_Pos                    _U_(31)                                              /**< (PIO_MSKR) PIO Line 31 Mask Position */
#define PIO_MSKR_MSK31_Msk                    (_U_(0x1) << PIO_MSKR_MSK31_Pos)                     /**< (PIO_MSKR) PIO Line 31 Mask Mask */
#define PIO_MSKR_MSK31(value)                 (PIO_MSKR_MSK31_Msk & ((value) << PIO_MSKR_MSK31_Pos))
#define   PIO_MSKR_MSK31_DISABLED_Val         _U_(0x0)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration.  */
#define   PIO_MSKR_MSK31_ENABLED_Val          _U_(0x1)                                             /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration.  */
#define PIO_MSKR_MSK31_DISABLED               (PIO_MSKR_MSK31_DISABLED_Val << PIO_MSKR_MSK31_Pos)  /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration. Position  */
#define PIO_MSKR_MSK31_ENABLED                (PIO_MSKR_MSK31_ENABLED_Val << PIO_MSKR_MSK31_Pos)   /**< (PIO_MSKR) Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx up2025-05-20s the corresponding I/O line configuration. Position  */
#define PIO_MSKR_Msk                          _U_(0xFFFFFFFF)                                      /**< (PIO_MSKR) Register Mask  */

#define PIO_MSKR_MSK_Pos                      _U_(0)                                               /**< (PIO_MSKR Position) PIO Line 3x Mask */
#define PIO_MSKR_MSK_Msk                      (_U_(0xFFFFFFFF) << PIO_MSKR_MSK_Pos)                /**< (PIO_MSKR Mask) MSK */
#define PIO_MSKR_MSK(value)                   (PIO_MSKR_MSK_Msk & ((value) << PIO_MSKR_MSK_Pos))   

