MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamrh71/thirdparty/atsamrh71/component/pio.h
/* -------- PIO_WPMR : (PIO Offset: 0x5E0) (R/W 32) PIO Write Protection Mode Register -------- */
#define PIO_WPMR_WPEN_Pos                     _U_(0)                                               /**< (PIO_WPMR) Write Protection Enable Position */
#define PIO_WPMR_WPEN_Msk                     (_U_(0x1) << PIO_WPMR_WPEN_Pos)                      /**< (PIO_WPMR) Write Protection Enable Mask */
#define PIO_WPMR_WPEN(value)                  (PIO_WPMR_WPEN_Msk & ((value) << PIO_WPMR_WPEN_Pos))
#define PIO_WPMR_WPITEN_Pos                   _U_(1)                                               /**< (PIO_WPMR) Write Protection Interrupt Enable Position */
#define PIO_WPMR_WPITEN_Msk                   (_U_(0x1) << PIO_WPMR_WPITEN_Pos)                    /**< (PIO_WPMR) Write Protection Interrupt Enable Mask */
#define PIO_WPMR_WPITEN(value)                (PIO_WPMR_WPITEN_Msk & ((value) << PIO_WPMR_WPITEN_Pos))
#define PIO_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (PIO_WPMR) Write Protection Key Position */
#define PIO_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << PIO_WPMR_WPKEY_Pos)                /**< (PIO_WPMR) Write Protection Key Mask */
#define PIO_WPMR_WPKEY(value)                 (PIO_WPMR_WPKEY_Msk & ((value) << PIO_WPMR_WPKEY_Pos))
#define   PIO_WPMR_WPKEY_PASSWD_Val           _U_(0x50494F)                                        /**< (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PIO_WPMR_WPKEY_PASSWD                 (PIO_WPMR_WPKEY_PASSWD_Val << PIO_WPMR_WPKEY_Pos)    /**< (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define PIO_WPMR_Msk                          _U_(0xFFFFFF03)                                      /**< (PIO_WPMR) Register Mask  */


/* -------- PIO_WPSR : (PIO Offset: 0x5E4) ( R/ 32) PIO Write Protection Status Register -------- */
#define PIO_WPSR_WPVS_Pos                     _U_(0)                                               /**< (PIO_WPSR) Write Protection Violation Status Position */
#define PIO_WPSR_WPVS_Msk                     (_U_(0x1) << PIO_WPSR_WPVS_Pos)                      /**< (PIO_WPSR) Write Protection Violation Status Mask */
#define PIO_WPSR_WPVS(value)                  (PIO_WPSR_WPVS_Msk & ((value) << PIO_WPSR_WPVS_Pos))
#define PIO_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (PIO_WPSR) Write Protection Violation Source Position */
#define PIO_WPSR_WPVSRC_Msk                   (_U_(0xFFFF) << PIO_WPSR_WPVSRC_Pos)                 /**< (PIO_WPSR) Write Protection Violation Source Mask */
#define PIO_WPSR_WPVSRC(value)                (PIO_WPSR_WPVSRC_Msk & ((value) << PIO_WPSR_WPVSRC_Pos))
#define PIO_WPSR_Msk                          _U_(0x00FFFF01)                                      /**< (PIO_WPSR) Register Mask  */


/** \brief PIO register offsets definitions */
#define PIO_MSKR_REG_OFST              (0x00)              /**< (PIO_MSKR) PIO Mask Register Offset */
#define PIO_CFGR_REG_OFST              (0x04)              /**< (PIO_CFGR) PIO Configuration Register Offset */
#define PIO_PDSR_REG_OFST              (0x08)              /**< (PIO_PDSR) PIO Pin Data Status Register Offset */
#define PIO_LOCKSR_REG_OFST            (0x0C)              /**< (PIO_LOCKSR) PIO Lock Status Register Offset */
#define PIO_SODR_REG_OFST              (0x10)              /**< (PIO_SODR) PIO Set Output Data Register Offset */
#define PIO_CODR_REG_OFST              (0x14)              /**< (PIO_CODR) PIO Clear Output Data Register Offset */
#define PIO_ODSR_REG_OFST              (0x18)              /**< (PIO_ODSR) PIO Output Data Status Register Offset */
#define PIO_IER_REG_OFST               (0x20)              /**< (PIO_IER) PIO Interrupt Enable Register Offset */
#define PIO_IDR_REG_OFST               (0x24)              /**< (PIO_IDR) PIO Interrupt Disable Register Offset */
#define PIO_IMR_REG_OFST               (0x28)              /**< (PIO_IMR) PIO Interrupt Mask Register Offset */
#define PIO_ISR_REG_OFST               (0x2C)              /**< (PIO_ISR) PIO Interrupt Status Register Offset */
#define PIO_IOFR_REG_OFST              (0x3C)              /**< (PIO_IOFR) PIO I/O Freeze Configuration Register Offset */
#define PIO_SCDR_REG_OFST              (0x500)             /**< (PIO_SCDR) PIO Slow Clock Divider Debouncing Register Offset */
#define PIO_WPMR_REG_OFST              (0x5E0)             /**< (PIO_WPMR) PIO Write Protection Mode Register Offset */
#define PIO_WPSR_REG_OFST              (0x5E4)             /**< (PIO_WPSR) PIO Write Protection Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PIO_GROUP register API structure */
typedef struct
{
  __IO  uint32_t                       PIO_MSKR;           /**< Offset: 0x00 (R/W  32) PIO Mask Register */
  __IO  uint32_t                       PIO_CFGR;           /**< Offset: 0x04 (R/W  32) PIO Configuration Register */
  __I   uint32_t                       PIO_PDSR;           /**< Offset: 0x08 (R/   32) PIO Pin Data Status Register */
  __I   uint32_t                       PIO_LOCKSR;         /**< Offset: 0x0C (R/   32) PIO Lock Status Register */
  __O   uint32_t                       PIO_SODR;           /**< Offset: 0x10 ( /W  32) PIO Set Output Data Register */
  __O   uint32_t                       PIO_CODR;           /**< Offset: 0x14 ( /W  32) PIO Clear Output Data Register */
  __IO  uint32_t                       PIO_ODSR;           /**< Offset: 0x18 (R/W  32) PIO Output Data Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       PIO_IER;            /**< Offset: 0x20 ( /W  32) PIO Interrupt Enable Register */
  __O   uint32_t                       PIO_IDR;            /**< Offset: 0x24 ( /W  32) PIO Interrupt Disable Register */
  __I   uint32_t                       PIO_IMR;            /**< Offset: 0x28 (R/   32) PIO Interrupt Mask Register */
  __I   uint32_t                       PIO_ISR;            /**< Offset: 0x2C (R/   32) PIO Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __O   uint32_t                       PIO_IOFR;           /**< Offset: 0x3C ( /W  32) PIO I/O Freeze Configuration Register */
} pio_group_registers_t;

#define PIO_GROUP_NUMBER _U_(7)

/** \brief PIO register API structure */
typedef struct
{
        pio_group_registers_t          PIO_GROUP[PIO_GROUP_NUMBER]; /**< Offset: 0x00  */
  __I   uint8_t                        Reserved1[0x340];
  __IO  uint32_t                       PIO_SCDR;           /**< Offset: 0x500 (R/W  32) PIO Slow Clock Divider Debouncing Register */
  __I   uint8_t                        Reserved2[0xDC];
  __IO  uint32_t                       PIO_WPMR;           /**< Offset: 0x5E0 (R/W  32) PIO Write Protection Mode Register */
  __I   uint32_t                       PIO_WPSR;           /**< Offset: 0x5E4 (R/   32) PIO Write Protection Status Register */
} pio_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_PIO_COMPONENT_H_ */
